export const attendanceRecordsFixture = [
	// 根本将治（イベント1, 4/11）の来場記録
	{
		attendanceRecordId: "30000000-0000-0000-0000-000000000001",
		recordedAt: new Date("2026-04-11T09:15:00+09:00"),
		volunteerId: "20000000-0000-0000-0000-000000000001",
	},
	// 田中一郎（イベント1, 4/11, 4/12, 4/13）の来場記録
	{
		attendanceRecordId: "30000000-0000-0000-0000-000000000002",
		recordedAt: new Date("2026-04-11T08:45:00+09:00"),
		volunteerId: "20000000-0000-0000-0000-000000000002",
	},
	{
		attendanceRecordId: "30000000-0000-0000-0000-000000000003",
		recordedAt: new Date("2026-04-12T09:30:00+09:00"),
		volunteerId: "20000000-0000-0000-0000-000000000002",
	},
	{
		attendanceRecordId: "30000000-0000-0000-0000-000000000004",
		recordedAt: new Date("2026-04-13T10:00:00+09:00"),
		volunteerId: "20000000-0000-0000-0000-000000000002",
	},
	// 高橋健二（イベント2, 5/3）の来場記録
	{
		attendanceRecordId: "30000000-0000-0000-0000-000000000005",
		recordedAt: new Date("2026-05-03T09:00:00+09:00"),
		volunteerId: "20000000-0000-0000-0000-000000000006",
	},
];
